app/Controllers/Carrito_controller.php

SELECT `u`.`id`, `c`.`nombre`, `c`.`telefono`, `u`.`total_venta`, `u`.`fecha`, `u`.`hora`, `u`.`tipo_pago`
FROM `ventas_cabecera` `u`
JOIN `cliente` `c` ON `u`.`id_cliente` = `c`.`id_cliente`
---
	public function ListComprasCabecera(){
		//Me conecto a la base de datos
		$db = db_connect();
		//Me ubico en la tabla ventas_cabecera y genero un alias "u" y guardo su contenido en $bluider
		$builder = $db->table('ventas_cabecera u');
		//Selecciono de ambas tablas (Cabecera y Detalle) los campos que necesito mostrar en la vista
		$builder->select('u.id , d.nombre , d.apellido, d.telefono , d.direccion , u.total_venta , u.fecha , u.hora , u.tipo_pago');
		//Con un Join relaciono los "id" de ambas tablas para generar una sola con todos los datos
		$builder->join('usuarios d','u.usuario_id = d.id');
		//Guardo el contenido de la relacion de ambas tablas en la variable $ventas
		$ventas= $builder->get();