app/Models/Clientes_model.php

    public function getClientes(){

        return $this->findAll();
---
SELECT *
FROM `cliente`