app/Models/Productos_model.php

    public function getProdBaja($eliminado){

    	return $this->where('eliminado',$eliminado)->findAll();
---
SELECT *
FROM `productos`
WHERE `eliminado` = 'NO'

    public function getProducto($id){

    	return $this->where('id',$id)->first($id);
---
SELECT *
FROM `productos`
WHERE `id` = '1'
 LIMIT 1