app/Models/Servicios_model.php

    public function getServicio(){

        return $this->findAll();
---
SELECT *
FROM `servicios`

    public function getServi($id){

    	return $this->where('id_servi',$id)->first($id);
---
SELECT *
FROM `servicios`
WHERE `id_servi` = '1'
 LIMIT 1