app/Models/turnos_model.php

UPDATE `turnos` SET `id_barber` = '2', `hora_turno` = '20:10', `id_servi` = '1'
WHERE `id` = '36'
---
    public function actualizar_turno($id_turno, $data) {
        return $this->db->table('turnos') // Indicar la tabla
                        ->where('id', $id_turno) // Condición
                        ->update($data); // Actualización

SELECT `t`.*, `c`.`nombre` AS `cliente_nombre`, `c`.`telefono` AS `cliente_telefono`, `s`.`descripcion` AS `servicio`, `s`.`precio`, `s`.`seccion_id`
FROM `turnos` `t`
LEFT JOIN `cliente` `c` ON `c`.`id_cliente` = `t`.`id_cliente`
LEFT JOIN `servicios` `s` ON `s`.`id_servi` = `t`.`id_servi`
WHERE `t`.`estado` = 'Pendiente'
AND `t`.`fecha_turno` = '2026-01-28'
ORDER BY `t`.`inicio` ASC
---
     public function obtenerTurnos(array $filtros = [])
{
    $builder = $this->db->table('turnos t');

    $builder->select('
        t.*,
        c.nombre AS cliente_nombre,
        c.telefono AS cliente_telefono,
        s.descripcion AS servicio,
        s.precio,
        s.seccion_id
    ');

    $builder->join('cliente c', 'c.id_cliente = t.id_cliente');
    $builder->join('servicios s', 's.id_servi = t.id_servi');

    if (!empty($filtros['estado'])) {
        $builder->where('t.estado', $filtros['estado']);
    }

    if (!empty($filtros['fecha_turno'])) {
        $builder->where('t.fecha_turno', $filtros['fecha_turno']);
    }

    $builder->orderBy('t.inicio', 'ASC');

    return $builder->get()->getResultArray();

SELECT `t`.`id`, `t`.`id_barber`, `t`.`hora_turno`, `t`.`estado`, `t`.`fecha_turno`, `t`.`fecha_registro`, `t`.`id_servi`, `c`.`nombre` AS `cliente_nombre`, `c`.`telefono` AS `cliente_telefono`, `u`.`nombre` AS `barber_nombre`, `s`.`descripcion`, `s`.`precio`
FROM `turnos` `t`
JOIN `cliente` `c` ON `c`.`id_cliente` = `t`.`id_cliente`
JOIN `usuarios` `u` ON `u`.`id` = `t`.`id_barber`
JOIN `servicios` `s` ON `s`.`id_servi` = `t`.`id_servi`
WHERE `t`.`estado` = 'Pendiente'
AND `t`.`fecha_turno` = '25-11-2024'
---
    public function obtenerTurnosCompletados()
    {
        return $this->select('
                turnos.id,
                turnos.id_barber,
                turnos.hora_turno,
                turnos.estado,
                turnos.fecha_registro,
                turnos.fecha_turno,
                turnos.id_servi,
                cliente.nombre AS cliente_nombre,
                cliente.telefono AS cliente_telefono,
                usuarios.nombre AS barber_nombre,
                servicios.descripcion,
                servicios.precio
            ')
            ->join('cliente', 'cliente.id_cliente = turnos.id_cliente')
            ->join('usuarios', 'usuarios.id = turnos.id_barber')
            ->join('servicios', 'servicios.id_servi = turnos.id_servi')
            ->where('turnos.estado', 'Listo')
            ->orderBy('turnos.fecha_turno', 'DESC')
            ->orderBy('turnos.hora_turno', 'DESC ')
            ->findAll();