app/Models/Usuarios_model.php

SELECT *
FROM `usuarios`
WHERE `baja` = 'NO'
---
    public function getUsBaja($baja){

    	return $this->where('baja',$baja)->findAll();